package com.dsa.module1._1_4_sort_search;

/**
 * В первой строке даны целое число n (1≤n≤100000) и массив A[1…n] из n различных натуральных чисел,
 * не превышающих 109, в порядке возрастания, во второй – целое число k (1≤k≤100000) и
 * k натуральных чисел b1,…,bk, не превышающих 109.
 * Для каждого i от 1 до k необходимо вывести индекс 1≤j≤n, для которого A[j]=bi, или −1, если такого j нет.
 *
 * Sample Input:
 * 5 1 5 8 12 13
 * 5 8 1 23 1 11
 *
 * Sample Output:
 * 3 1 -1 1 -1
 *
 *
 * Input:




 7 1 2 5 10 15 23 40
 5 10 3 1 2 8


 Output:




 4 -1 1 2 -1

 */
public class BinarySearch {

    public static void main(String[] args) {



    }
}
